Revit 2026 API

# GradientGradientNoiseLevels Property

---

The property labeled "Levels" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientNoiseLevels { get; }
```
```vb
Public Shared ReadOnly Property GradientNoiseLevels As String
	Get
```
```cpp
public:
static property String^ GradientNoiseLevels {
	String^ get ();
}
```
```fsharp
static member GradientNoiseLevels : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "1, 10".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace